stepci/loadtest.yml
version: "1.1"
name: Load Test
env:
  host: example.com
config:
  loadTest:
    phases:
      - duration: 2
        arrivalRate: 1
      - duration: 10
        arrivalRate: 2
tests:
  example:
    steps:
      - name: GET request
        http:
          url: https://${{env.host}}/health-check
          method: GET